# Data Cleaning

This notebook aims to show a subset of methods used to clean datasets before performing further analysis and visualisations.

It is splitted in 2 parts : the dataset generation, and the data cleaning process.  
- **Dataset generation** permits to parametrise the dataset generation.
- **Data cleaning process** showcases the different methods explained in the README.

## 1) Dataset generation

In [1]:
from dataset_generation import *

In [2]:
dataframe = generate_dataset(length=500, name_errors=0.2, missing_errors=0.8, category_errors=0.25,
                             height_errors=0.15, salary_errors=0.07)
dataframe.head(10)

,Name,Missing,Category,Height,Salary,Date,Country,Email,Strange
0,NaN,NaN,Special,NaN,93000,2 1983-6,USA,9B1Ut.SkoZR@laposte.net,X7LLSoUSlq
1,NaN,NaN,Special,1.57,88000,3 1969-26,USA,RMjxg.W3Yep@gmail.com,BwBItj9uZs
2,John,NaN,null,2.01,46000,3 1999-23,USA,QgcY2.84ydd@hotmail.com,2yBy6xRMuO
3,NaN,NaN,Regular,1.62,68000,6 1980-27,SAF,QhesO.0ZHiH@laposte.net,bfmkc5TPVF
4,Thomas,56.0,Special,2.10,124000,11 1980-27,USA,2EaDA.nFget@hotmail.com,J56iJ77KGl
5,Patricia,NaN,Regular,1.55,68000,3 1982-26,Brasil,r2MGQ.0fip0@gmail.com,W0DDm0hZlH
6,Joseph,NaN,Special,1.58,41000,9 2010-13,France,Q8jBw.saull@laposte.net,MilCa8RXE8
7,Susan,NaN,NaN,1.60,38000,11 2000-14,Brasil,yIDdk.YWZMi@gmail.com,UaBaEle95K
8,William,NaN,Classic,1.89,85000,10 2017-19,China,QA9QV.oB7s6@weneverknow.com,GfSproq9u0
9,Elizabeth,NaN,Special,NaN,138000,5 2013-22,USA,K2cKv.N5ytE@gmail.com,X4KqTtiVFV

### a/ Strange feature deletion

Sometimes, there are features in your data that seem relatively strange, and in some cases that are really hard to understand or apprehend. They can be useless features, and to avoid wrong interpretations later in your analysis, deleting this strange feature can be an option.

In my dataset, I voluntarily created a **Strange** feature, to showcase the ability to prepare your data and continue your analysis on an appropriate perimeter of data.

In [3]:
# Look at the first few lines of the dataset to get a sense of data
dataframe.head()

,Name,Missing,Category,Height,Salary,Date,Country,Email,Strange
0,NaN,NaN,Special,NaN,93000,2 1983-6,USA,9B1Ut.SkoZR@laposte.net,X7LLSoUSlq
1,NaN,NaN,Special,1.57,88000,3 1969-26,USA,RMjxg.W3Yep@gmail.com,BwBItj9uZs
2,John,NaN,null,2.01,46000,3 1999-23,USA,QgcY2.84ydd@hotmail.com,2yBy6xRMuO
3,NaN,NaN,Regular,1.62,68000,6 1980-27,SAF,QhesO.0ZHiH@laposte.net,bfmkc5TPVF
4,Thomas,56.0,Special,2.10,124000,11 1980-27,USA,2EaDA.nFget@hotmail.com,J56iJ77KGl

In [4]:
# Drop the "Useless" feature of the dataset
dataframe = dataframe.drop(['Strange'], axis=1)

In [5]:
# Have another look on the data without the useless feature that has been deleted
dataframe.head()

,Name,Missing,Category,Height,Salary,Date,Country,Email
0,NaN,NaN,Special,NaN,93000,2 1983-6,USA,9B1Ut.SkoZR@laposte.net
1,NaN,NaN,Special,1.57,88000,3 1969-26,USA,RMjxg.W3Yep@gmail.com
2,John,NaN,null,2.01,46000,3 1999-23,USA,QgcY2.84ydd@hotmail.com
3,NaN,NaN,Regular,1.62,68000,6 1980-27,SAF,QhesO.0ZHiH@laposte.net
4,Thomas,56.0,Special,2.10,124000,11 1980-27,USA,2EaDA.nFget@hotmail.com

After deleting the `Strange` feature I was not interested in, I just have a look at my dataset to check the proper deletion of this feature, and continue my Data Cleaning process.

### b/ Missing values as a special category

In this part, I will study the different values that take the **Category** feature of my dataset.

I quickly detect there are a few values that are taken and that represent a missing or an invalid value for the category. Therefore, I want to treat all these different values as a single and unique representation of the missing value concept : affect them all to the same category that I can myself rename `Unknown`.

In [6]:
# Check the different values taken by data for the Category feature
dataframe['Category'].value_counts()

Special    139
Classic    120
Regular    116
???         36
null        30
NaN         30
UNKWN       29
Name: Category, dtype: int64

In [7]:
# Replace data missing values for the Category feature by a single and dedicated value
dataframe['Category'].replace(['NaN', 'null', 'UNKWN', '???'], ['Unknown']*4, inplace=True)

In [8]:
# Check the different values taken by data for the Category feature, after missing category cleaning process
dataframe['Category'].value_counts()

Special    139
Unknown    125
Classic    120
Regular    116
Name: Category, dtype: int64

After having checked my transformed dataset with this single missing value for the Category feature, I will be able to process this feature later on knowing it can take values I had a glance on (`Classic`, `Regular`, `Special`), or the `Unknown` missing value.

### c/ Fixing spelling mistakes with known correct values

There is a **Country** feature in my dataset that contains a few country names, but some of them are sometimes spelled or written in a strange way. That can totally happen in real life when you collect data from multiple sources and these sources do not have the same software/language references.

Then, I will try to understand the misspelled values and replace them by a uniformed writting.

In [9]:
# Check the different values taken by data for the Country feature
dataframe['Country'].value_counts()

South Africa    83
Brasil          79
USA             74
France          68
China           68
SAF             31
Fr              28
brUsil          28
uSa             25
CHinA           16
Name: Country, dtype: int64

As we can see in the different values that can take the Country feature, there are few ones that misspelled or abstracted, but we can guess the name of the real country behind it. For example, *Fr* probably means *France*, *CHinA* and *uSa* is of course a misspelling, *SAF* in an abstraction of *South Africa* and *brUsil* is totally a mistake in data.

In [10]:
# Replace misspelled and erroneous values for the Country feature by a known correct values
dataframe['Country'].replace(['SAF', 'Fr', 'CHinA', 'uSa', 'brUsil'],
                             ['South Africa', 'France', 'China', 'USA', 'Brasil'], inplace=True)

In [11]:
# Check the different values taken by data for the Country feature, after fixing misspelled values
dataframe['Country'].value_counts()

South Africa    114
Brasil          107
USA              99
France           96
China            84
Name: Country, dtype: int64

With this spellchecking and fixing step of the Data Cleaning process, we now clearly see the different countries involved in the dataset, with no surprising or confusing values.

### d/ Mean filling for missing values

The **Height** feature of the dataset miss a few values, but not a large amount. In order to analyse the data without deleting too much information, it can be clever in some cases to replace missing values in numerical features by the mean of this feature.

There are not too much outliers in this feature, so replacing missing values by the mean can be a good choice.

In [12]:
# Check the proportion of null values in the Height feature
height_null_values = sum(dataframe['Height'].isnull() == True)
height_notnull_values = sum(dataframe['Height'].isnull() == False)
print("Height feature has {} null values and {} not null values !".format(height_null_values, height_notnull_values))

Height feature has 75 null values and 425 not null values !

In [13]:
# Compute the mean value of the Height feature in the dataset, and replace missing values with it
height_mean_value = round(dataframe["Height"].mean(), 2)
dataframe['Height'].fillna(height_mean_value, inplace=True)

In [14]:
# Check the proportion of null values in the Height feature after mean filling
height_null_values = sum(dataframe['Height'].isnull() == True)
height_notnull_values = sum(dataframe['Height'].isnull() == False)
print("Height feature has {} null values and {} not null values !".format(height_null_values, height_notnull_values))

Height feature has 0 null values and 500 not null values !

Once the `Height` feature missing values have been replaced with the mean value, you shall heterogeneous set of values on this feature to do further analysis.

### e/ Useless observations deletion

The **Name** feature, in my dataset example, serves as an identifier of each observation. We can face cases with real world data, where these identifiers are not filled. There are a bunch of data available, but we cannot link them to a defined indentifier, a specific object or individual.

This generally means whathever the analysis you will make on your data, you will be blocked at some point for some cases where you need to identify a data point. Thus, it is sometimes useful to delete these points for some specific analysis.

In [15]:
# Check the proportion of null values in the Name feature
name_null_values = sum(dataframe['Name'].isnull() == True)
name_notnull_values = sum(dataframe['Name'].isnull() == False)
print("Name feature has {} null values and {} not null values !".format(name_null_values, name_notnull_values))

Name feature has 100 null values and 400 not null values !

In [16]:
# Delete observations where Name feature value is missing
dataframe = dataframe.dropna(subset=['Name'])

In [17]:
# Check the proportion of null values in the Name feature after mean filling
name_null_values = sum(dataframe['Name'].isnull() == True)
name_notnull_values = sum(dataframe['Name'].isnull() == False)
print("Name feature has {} null values and {} not null values !".format(name_null_values, name_notnull_values))

Name feature has 0 null values and 400 not null values !

Deleting observations that have missing values for the `Name` feature shall reduce your dataset size, but help you to do identification and relationships analysis easier.

### f/ Useless feature deletion

There is a **Missing** feature in my dataset that, like its name indicates, misses a large amount of data. When a feature lacks information on the majority of the data points, this means this feature does not really bring something interesting to the analysis done later on.

In this case, this feature is considered useless and better be deleted.

In [18]:
# Check the few first lines of the dataset and especially the Missing feature values
dataframe.head()

,Name,Missing,Category,Height,Salary,Date,Country,Email
2,John,NaN,Unknown,2.01,46000,3 1999-23,USA,QgcY2.84ydd@hotmail.com
4,Thomas,56.0,Special,2.10,124000,11 1980-27,USA,2EaDA.nFget@hotmail.com
5,Patricia,NaN,Regular,1.55,68000,3 1982-26,Brasil,r2MGQ.0fip0@gmail.com
6,Joseph,NaN,Special,1.58,41000,9 2010-13,France,Q8jBw.saull@laposte.net
7,Susan,NaN,Unknown,1.60,38000,11 2000-14,Brasil,yIDdk.YWZMi@gmail.com

In [19]:
# Drop the "Missing" feature of the dataset
dataframe = dataframe.drop(['Missing'], axis=1)

In [20]:
# Look back at the dataset with Missing feature deleted
dataframe.head()

,Name,Category,Height,Salary,Date,Country,Email
2,John,Unknown,2.01,46000,3 1999-23,USA,QgcY2.84ydd@hotmail.com
4,Thomas,Special,2.10,124000,11 1980-27,USA,2EaDA.nFget@hotmail.com
5,Patricia,Regular,1.55,68000,3 1982-26,Brasil,r2MGQ.0fip0@gmail.com
6,Joseph,Special,1.58,41000,9 2010-13,France,Q8jBw.saull@laposte.net
7,Susan,Unknown,1.60,38000,11 2000-14,Brasil,yIDdk.YWZMi@gmail.com

When a useless feature is deleted, models and statistics used on the dataset get more precise because they are not perturbated anymore by a lot of incorrected or missing data. It is really important to focus solely on data that has interest.

### g/ Median filling for erroneous values

The **Salary** feature of the dataset has a few values that do not seem plausible, they may be an error. When data is missing or is irrelevant in a numerical feature, and this numerical feature has potentially large outliers in it, replacing the data by the median instead of the mean can be more appropriate.

I voluntarily genertated great outliers, and I want to show how we can replace them by the median of the feature.

In [21]:
max_salary = max(dataframe['Salary'])
min_salary = min(dataframe['Salary'])
mean_salary = math.ceil(round(dataframe['Salary'].mean(), 0))
median_salary = math.ceil(dataframe['Salary'].median())
print("Salary feature : max={}, min={}, mean={}, median={}".format(max_salary, min_salary, mean_salary, median_salary))

Salary feature : max=497000, min=30000, mean=113130, median=91000

In [22]:
# Compute the mean value of the Height feature in the dataset, and replace missing values with it
max_salary_no_outlier = mean_salary = math.ceil(round(dataframe['Salary'].mean() * 2.5, 0))
dataframe = dataframe.reset_index()
high_salary_indices = dataframe[(dataframe["Salary"] > max_salary_no_outlier)].index
dataframe.iloc[high_salary_indices, [dataframe.columns.get_loc('Salary')]] = median_salary

In [23]:
max_salary = max(dataframe["Salary"])
min_salary = min(dataframe["Salary"])
mean_salary = math.ceil(round(dataframe["Salary"].mean(), 0))
median_salary = math.ceil(dataframe["Salary"].median())
print("Salary feature : max={}, min={}, mean={}, median={}".format(max_salary, min_salary, mean_salary, median_salary))

Salary feature : max=144000, min=30000, mean=87418, median=91000

Once the `Salary` feature outliers have been replaced with the median value, further analysis shall be more precise and interesting.

### h/ Dates wrong formatting

There are often dates type features in datasets, in mine we can find the evident **Date** feature. Dates features often present bad formatting according countries, times, or sources where we got your data from. It is vital to clean dates features especially on a uniform form, throughout your feature, and throughout your entire dataset.

I invented a confusing representation of dates in my artificially generated dataset, that I need to cleanse.

In [24]:
# Check the first few lines of the dataset, to have a look on the dates format of my Date feature
dataframe.head()

,index,Name,Category,Height,Salary,Date,Country,Email
0,2,John,Unknown,2.01,46000,3 1999-23,USA,QgcY2.84ydd@hotmail.com
1,4,Thomas,Special,2.10,124000,11 1980-27,USA,2EaDA.nFget@hotmail.com
2,5,Patricia,Regular,1.55,68000,3 1982-26,Brasil,r2MGQ.0fip0@gmail.com
3,6,Joseph,Special,1.58,41000,9 2010-13,France,Q8jBw.saull@laposte.net
4,7,Susan,Unknown,1.60,38000,11 2000-14,Brasil,yIDdk.YWZMi@gmail.com

In [25]:
# Transform the whole feature into a real datetime format, precising the data input format provided
dataframe['Date'] = pd.to_datetime(dataframe['Date'], format="%m %Y-%d")

In [26]:
# Check the good transformation of dates format in the dataset
dataframe.head()

,index,Name,Category,Height,Salary,Date,Country,Email
0,2,John,Unknown,2.01,46000,1999-03-23,USA,QgcY2.84ydd@hotmail.com
1,4,Thomas,Special,2.10,124000,1980-11-27,USA,2EaDA.nFget@hotmail.com
2,5,Patricia,Regular,1.55,68000,1982-03-26,Brasil,r2MGQ.0fip0@gmail.com
3,6,Joseph,Special,1.58,41000,2010-09-13,France,Q8jBw.saull@laposte.net
4,7,Susan,Unknown,1.60,38000,2000-11-14,Brasil,yIDdk.YWZMi@gmail.com

Now my dates format have been cleansed in the `Date` feature, we should have a better view of dates in the dataset.

### i/ Strange obervations deletion

On some features of a dataset, strange values may sometimes appear, and it is difficult to understand whether it is a normal value or a harmful, confusing and non intentional value (that could have been introduced in the process). In the case of my **Email** feature, a very strange or non comprehensive email suffix can mean a lot of things.

In this context, I will show how to delete these observations to protect the dataset and run only meaningfull analysis on verified individuals.

In [27]:
# Check all the existing email suffices in the initial dataset
email_suffices = pd.DataFrame({"Suffices": dataframe["Email"].str.split("@", expand=True)[1]})
email_suffices["Suffices"].value_counts()

gmail.com          162
hotmail.com        125
laposte.net         82
test.xxx            11
darkmagic           10
weneverknow.com     10
Name: Suffices, dtype: int64

In [28]:
# Retrieve indices of observations with harmful email suffices and delete them
harmful_email_indices = email_suffices[(email_suffices['Suffices'] == 'darkmagic')
                                       | (email_suffices['Suffices'] == 'test.xxx')
                                       | (email_suffices['Suffices'] == 'weneverknow.com')].index
dataframe.drop(harmful_email_indices, inplace=True)

In [29]:
# Check whether the deletion of observations with harmful email suffices worked 
email_suffices = pd.DataFrame({"Suffices": dataframe["Email"].str.split("@", expand=True)[1]})
email_suffices["Suffices"].value_counts()

gmail.com      162
hotmail.com    125
laposte.net     82
Name: Suffices, dtype: int64

Now the few potentially harmful `Email` addresses have been deleted, we are narrowing our individuals with interesting data and trustable information.